###############################################################################
# Created by write_sdc
# Sat May 30 18:12:15 2026
###############################################################################
current_design sram_wrapper
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name clk -period 10.0000 [get_ports {clk}]
set_clock_transition 0.1500 [get_clocks {clk}]
set_clock_uncertainty 0.2500 clk
set_propagated_clock [get_clocks {clk}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pd_addr[0]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pd_addr[1]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pd_addr[2]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pd_addr[3]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pd_addr[4]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pd_addr[5]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pd_addr[6]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pd_addr[7]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pd_addr[8]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pd_re}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pd_sel}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pd_wdata[0]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pd_wdata[10]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pd_wdata[11]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pd_wdata[12]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pd_wdata[13]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pd_wdata[14]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pd_wdata[15]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pd_wdata[16]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pd_wdata[17]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pd_wdata[18]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pd_wdata[19]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pd_wdata[1]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pd_wdata[20]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pd_wdata[21]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pd_wdata[22]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pd_wdata[23]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pd_wdata[24]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pd_wdata[25]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pd_wdata[26]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pd_wdata[27]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pd_wdata[28]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pd_wdata[29]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pd_wdata[2]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pd_wdata[30]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pd_wdata[31]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pd_wdata[3]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pd_wdata[4]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pd_wdata[5]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pd_wdata[6]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pd_wdata[7]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pd_wdata[8]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pd_wdata[9]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pd_we}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rx_addr[0]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rx_addr[1]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rx_addr[2]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rx_addr[3]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rx_addr[4]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rx_addr[5]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rx_addr[6]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rx_addr[7]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rx_addr[8]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rx_addr[9]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rx_din[0]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rx_din[1]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rx_din[2]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rx_din[3]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rx_din[4]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rx_din[5]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rx_din[6]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rx_din[7]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rx_we}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {tx_addr[0]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {tx_addr[1]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {tx_addr[2]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {tx_addr[3]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {tx_addr[4]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {tx_addr[5]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {tx_addr[6]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {tx_addr[7]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {tx_addr[8]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {tx_addr[9]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pd_dout[0]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pd_dout[10]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pd_dout[11]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pd_dout[12]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pd_dout[13]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pd_dout[14]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pd_dout[15]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pd_dout[16]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pd_dout[17]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pd_dout[18]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pd_dout[19]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pd_dout[1]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pd_dout[20]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pd_dout[21]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pd_dout[22]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pd_dout[23]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pd_dout[24]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pd_dout[25]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pd_dout[26]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pd_dout[27]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pd_dout[28]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pd_dout[29]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pd_dout[2]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pd_dout[30]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pd_dout[31]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pd_dout[3]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pd_dout[4]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pd_dout[5]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pd_dout[6]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pd_dout[7]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pd_dout[8]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pd_dout[9]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rx_dout[0]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rx_dout[1]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rx_dout[2]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rx_dout[3]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rx_dout[4]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rx_dout[5]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rx_dout[6]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rx_dout[7]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {tx_dout[0]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {tx_dout[1]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {tx_dout[2]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {tx_dout[3]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {tx_dout[4]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {tx_dout[5]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {tx_dout[6]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {tx_dout[7]}]
###############################################################################
# Environment
###############################################################################
set_load -pin_load 0.0334 [get_ports {pd_dout[31]}]
set_load -pin_load 0.0334 [get_ports {pd_dout[30]}]
set_load -pin_load 0.0334 [get_ports {pd_dout[29]}]
set_load -pin_load 0.0334 [get_ports {pd_dout[28]}]
set_load -pin_load 0.0334 [get_ports {pd_dout[27]}]
set_load -pin_load 0.0334 [get_ports {pd_dout[26]}]
set_load -pin_load 0.0334 [get_ports {pd_dout[25]}]
set_load -pin_load 0.0334 [get_ports {pd_dout[24]}]
set_load -pin_load 0.0334 [get_ports {pd_dout[23]}]
set_load -pin_load 0.0334 [get_ports {pd_dout[22]}]
set_load -pin_load 0.0334 [get_ports {pd_dout[21]}]
set_load -pin_load 0.0334 [get_ports {pd_dout[20]}]
set_load -pin_load 0.0334 [get_ports {pd_dout[19]}]
set_load -pin_load 0.0334 [get_ports {pd_dout[18]}]
set_load -pin_load 0.0334 [get_ports {pd_dout[17]}]
set_load -pin_load 0.0334 [get_ports {pd_dout[16]}]
set_load -pin_load 0.0334 [get_ports {pd_dout[15]}]
set_load -pin_load 0.0334 [get_ports {pd_dout[14]}]
set_load -pin_load 0.0334 [get_ports {pd_dout[13]}]
set_load -pin_load 0.0334 [get_ports {pd_dout[12]}]
set_load -pin_load 0.0334 [get_ports {pd_dout[11]}]
set_load -pin_load 0.0334 [get_ports {pd_dout[10]}]
set_load -pin_load 0.0334 [get_ports {pd_dout[9]}]
set_load -pin_load 0.0334 [get_ports {pd_dout[8]}]
set_load -pin_load 0.0334 [get_ports {pd_dout[7]}]
set_load -pin_load 0.0334 [get_ports {pd_dout[6]}]
set_load -pin_load 0.0334 [get_ports {pd_dout[5]}]
set_load -pin_load 0.0334 [get_ports {pd_dout[4]}]
set_load -pin_load 0.0334 [get_ports {pd_dout[3]}]
set_load -pin_load 0.0334 [get_ports {pd_dout[2]}]
set_load -pin_load 0.0334 [get_ports {pd_dout[1]}]
set_load -pin_load 0.0334 [get_ports {pd_dout[0]}]
set_load -pin_load 0.0334 [get_ports {rx_dout[7]}]
set_load -pin_load 0.0334 [get_ports {rx_dout[6]}]
set_load -pin_load 0.0334 [get_ports {rx_dout[5]}]
set_load -pin_load 0.0334 [get_ports {rx_dout[4]}]
set_load -pin_load 0.0334 [get_ports {rx_dout[3]}]
set_load -pin_load 0.0334 [get_ports {rx_dout[2]}]
set_load -pin_load 0.0334 [get_ports {rx_dout[1]}]
set_load -pin_load 0.0334 [get_ports {rx_dout[0]}]
set_load -pin_load 0.0334 [get_ports {tx_dout[7]}]
set_load -pin_load 0.0334 [get_ports {tx_dout[6]}]
set_load -pin_load 0.0334 [get_ports {tx_dout[5]}]
set_load -pin_load 0.0334 [get_ports {tx_dout[4]}]
set_load -pin_load 0.0334 [get_ports {tx_dout[3]}]
set_load -pin_load 0.0334 [get_ports {tx_dout[2]}]
set_load -pin_load 0.0334 [get_ports {tx_dout[1]}]
set_load -pin_load 0.0334 [get_ports {tx_dout[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {clk}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {pd_re}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {pd_sel}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {pd_we}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {rx_we}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {pd_addr[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {pd_addr[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {pd_addr[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {pd_addr[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {pd_addr[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {pd_addr[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {pd_addr[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {pd_addr[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {pd_addr[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {pd_wdata[31]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {pd_wdata[30]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {pd_wdata[29]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {pd_wdata[28]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {pd_wdata[27]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {pd_wdata[26]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {pd_wdata[25]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {pd_wdata[24]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {pd_wdata[23]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {pd_wdata[22]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {pd_wdata[21]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {pd_wdata[20]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {pd_wdata[19]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {pd_wdata[18]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {pd_wdata[17]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {pd_wdata[16]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {pd_wdata[15]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {pd_wdata[14]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {pd_wdata[13]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {pd_wdata[12]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {pd_wdata[11]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {pd_wdata[10]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {pd_wdata[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {pd_wdata[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {pd_wdata[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {pd_wdata[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {pd_wdata[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {pd_wdata[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {pd_wdata[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {pd_wdata[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {pd_wdata[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {pd_wdata[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {rx_addr[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {rx_addr[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {rx_addr[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {rx_addr[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {rx_addr[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {rx_addr[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {rx_addr[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {rx_addr[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {rx_addr[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {rx_addr[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {rx_din[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {rx_din[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {rx_din[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {rx_din[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {rx_din[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {rx_din[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {rx_din[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {rx_din[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {tx_addr[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {tx_addr[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {tx_addr[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {tx_addr[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {tx_addr[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {tx_addr[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {tx_addr[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {tx_addr[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {tx_addr[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {tx_addr[0]}]
set_timing_derate -early 0.9500
set_timing_derate -late 1.0500
###############################################################################
# Design Rules
###############################################################################
set_max_transition 0.7500 [current_design]
set_max_fanout 10.0000 [current_design]
